mrk7711/LPC1768-KeilCodes/28.Lock Co-Op 2/src/Task_Refresh.c
#include "Task_Refresh.h"


#include "lpc17xx_gpio.h"

const uint8_t segmentTable[]={0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,0x7F,0x6F};

uint8_t SegData[3];

void ShowData_Segment(uint8_t segmentNumber,uint8_t value)
{
  SegData[segmentNumber]=value;
}

void Task_Refresh(RunMail_Type runMail,uint8_t *paramsData)
{
  switch(Task_GetStepParam(paramsData))
  {
   case 0:
   {		 	
		 GPIO_ClearValue(0,(1<<3));
		 GPIO_SetValue(0,(1<<1));
		 FIO_ByteSetValue(1,2,segmentTable[SegData[0]]);
	   FIO_ByteClearValue(1,2,~segmentTable[SegData[0]]);
		 Task_Delay_ms(8,1);
	 }break;
	 case 1:
	 {
		 GPIO_ClearValue(0,(1<<1));
	   GPIO_SetValue(0,(1<<2));
	   FIO_ByteSetValue(1,2,segmentTable[SegData[1]]);
	   FIO_ByteClearValue(1,2,~segmentTable[SegData[1]]);
	   Task_Delay_ms(8,2);
	 }break;
	 case 2:
	 {
		GPIO_ClearValue(0,(1<<2));
		GPIO_SetValue(0,(1<<3));
		FIO_ByteSetValue(1,2,segmentTable[SegData[2]]);
		FIO_ByteClearValue(1,2,~segmentTable[SegData[2]]);
		Task_Delay_ms(8,0);
	 }break;
 }	
}